<a href="https://colab.research.google.com/github/EEdwardsA/DS-Unit-1-Sprint-1-Data-Wrangling-and-Storytelling/blob/master/module3-join-and-reshape-data/LS_DS_113_Join_and_Reshape_Data_Assignment_Elizabeth.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Lambda School Data Science

*Unit 1, Sprint 1, Module 3*

---

# Join and Reshape datasets

Objectives
- concatenate data with pandas
- merge data with pandas
-  understand tidy data formatting
-  melt and pivot data with pandas

Links
- [Pandas Cheat Sheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf)
- [Tidy Data](https://en.wikipedia.org/wiki/Tidy_data)
  - Combine Data Sets: Standard Joins
  - Tidy Data
  - Reshaping Data
- Python Data Science Handbook
  - [Chapter 3.6](https://jakevdp.github.io/PythonDataScienceHandbook/03.06-concat-and-append.html), Combining Datasets: Concat and Append
  - [Chapter 3.7](https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html), Combining Datasets: Merge and Join
  - [Chapter 3.8](https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html), Aggregation and Grouping
  - [Chapter 3.9](https://jakevdp.github.io/PythonDataScienceHandbook/03.09-pivot-tables.html), Pivot Tables
  
Reference
- Pandas Documentation: [Reshaping and Pivot Tables](https://pandas.pydata.org/pandas-docs/stable/reshaping.html)
- Modern Pandas, Part 5: [Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [1]:
!wget https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz

--2020-09-02 19:21:23--  https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz
Resolving s3.amazonaws.com (s3.amazonaws.com)... 52.216.82.99
Connecting to s3.amazonaws.com (s3.amazonaws.com)|52.216.82.99|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 205548478 (196M) [application/x-gzip]
Saving to: ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’

instacart_online_gr 100%[===================>] 196.03M  16.7MB/s    in 13s

2020-09-02 19:21:37 (14.9 MB/s) - ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’ saved [205548478/205548478]

In [2]:
!tar --gunzip --extract --verbose --file=instacart_online_grocery_shopping_2017_05_01.tar.gz

instacart_2017_05_01/
instacart_2017_05_01/._aisles.csv
instacart_2017_05_01/aisles.csv
instacart_2017_05_01/._departments.csv
instacart_2017_05_01/departments.csv
instacart_2017_05_01/._order_products__prior.csv
instacart_2017_05_01/order_products__prior.csv
instacart_2017_05_01/._order_products__train.csv
instacart_2017_05_01/order_products__train.csv
instacart_2017_05_01/._orders.csv
instacart_2017_05_01/orders.csv
instacart_2017_05_01/._products.csv
instacart_2017_05_01/products.csv

In [3]:
%cd instacart_2017_05_01

/content/instacart_2017_05_01

In [4]:
!ls -lh *.csv

-rw-r--r-- 1 502 staff 2.6K May  2  2017 aisles.csv
-rw-r--r-- 1 502 staff  270 May  2  2017 departments.csv
-rw-r--r-- 1 502 staff 551M May  2  2017 order_products__prior.csv
-rw-r--r-- 1 502 staff  24M May  2  2017 order_products__train.csv
-rw-r--r-- 1 502 staff 104M May  2  2017 orders.csv
-rw-r--r-- 1 502 staff 2.1M May  2  2017 products.csv

# Assignment

## Join Data Practice

These are the top 10 most frequently ordered products. How many times was each ordered? 

1. Banana
2. Bag of Organic Bananas
3. Organic Strawberries
4. Organic Baby Spinach 
5. Organic Hass Avocado
6. Organic Avocado
7. Large Lemon 
8. Strawberries
9. Limes 
10. Organic Whole Milk

First, write down which columns you need and which dataframes have them.

Next, merge these into a single dataframe.

Then, use pandas functions from the previous lesson to get the counts of the top 10 most frequently ordered products.

In [ ]:
##### YOUR CODE HERE #####
# Read in csvs
import pandas as pd

aisles = pd.read_csv('aisles.csv')
departments = pd.read_csv('departments.csv')
order_products__prior = pd.read_csv('order_products__prior.csv')
order_products__train = pd.read_csv('order_products__train.csv')
orders = pd.read_csv('orders.csv')
products = pd.read_csv('products.csv')
# Combine order products

In [7]:

order_products = pd.concat([order_products__prior, order_products__train])

In [8]:
# Check headers of dfs

aisles.head()

   aisle_id                       aisle
0         1       prepared soups salads
1         2           specialty cheeses
2         3         energy granola bars
3         4               instant foods
4         5  marinades meat preparation

In [9]:
departments.head()

   department_id department
0              1     frozen
1              2      other
2              3     bakery
3              4    produce
4              5    alcohol

In [10]:
order_products.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [11]:
orders.head()

   order_id  user_id  ... order_hour_of_day  days_since_prior_order
0   2539329        1  ...                 8                     NaN
1   2398795        1  ...                 7                    15.0
2    473747        1  ...                12                    21.0
3   2254736        1  ...                 7                    29.0
4    431534        1  ...                15                    28.0

[5 rows x 7 columns]

In [12]:
products.head()

   product_id  ... department_id
0           1  ...            19
1           2  ...            13
2           3  ...             7
3           4  ...             1
4           5  ...            13

[5 rows x 4 columns]

In [19]:
# Which columns do I need? I need product_name and product_id
# from products, and I need product_id and order_id from 
# order_products

# First, slim down the products df so that it only contains rows
# with the the 10 most popular items

condition = (products['product_name'] == 'Banana') | (products['product_name'] == 'Bag of Organic Bananas') | (products['product_name'] == 'Organic Strawberries') | (products['product_name'] == 'Organic Baby Spinach') | (products['product_name'] == 'Organic Hass Avocado') | (products['product_name'] == 'Organic Avocado') | (products['product_name'] == 'Large Lemon') | (products['product_name'] == 'Strawberries') | (products['product_name'] == 'Limes') | (products['product_name'] == 'Organic Whole Milk')

# The above is typed on one long line because I couldn't get the bitwise or 
# operator to function correctly across multiple lines of code

popular_products = products[condition]

popular_products.head(20)

       product_id            product_name  aisle_id  department_id
13175       13176  Bag of Organic Bananas        24              4
16796       16797            Strawberries        24              4
21136       21137    Organic Strawberries        24              4
21902       21903    Organic Baby Spinach       123              4
24851       24852                  Banana        24              4
26208       26209                   Limes        24              4
27844       27845      Organic Whole Milk        84             16
47208       47209    Organic Hass Avocado        24              4
47625       47626             Large Lemon        24              4
47765       47766         Organic Avocado        24              4

In [22]:
# This is good. Now I want to match product_id from popular_products to
# product_id in order_products. I'll apply a condition subsetting 
# order_products to only rows that hold a value present in popular_products

condition = order_products['product_id'].isin(popular_products['product_id'])

order_prod_subset = order_products[condition]

order_prod_subset.head(20)

     order_id  product_id  add_to_cart_order  reordered
12          3       21903                  4          1
30          5       13176                  1          1
51          5       47209                 22          0
77         10       24852                  1          1
80         10       47766                  4          1
83         10       21137                  7          1
126        14       27845                  2          1
170        18       47766                 27          1
180        20       24852                  6          0
190        22       24852                  3          1
206        23       47766                  5          1
234        26       24852                  2          1
238        26       21903                  6          0
240        26       47766                  8          1
241        27       13176                  1          1
247        27       47766                  7          1
273        28       47626                  6          1
279        28       47209                 12          1
286        29       13176                  3          1
294        31       21903                  3          1

In [23]:
# I'm going to make sure that order_prod_subset is a good deal smaller than
# order_products

order_products.shape

(33819106, 4)

In [24]:
order_prod_subset.shape

(2418314, 4)

In [25]:
# Okay, cool. Now I' will merge my data frames

merged = pd.merge(order_prod_subset, popular_products, on="product_id")

merged.head(20)

    order_id  product_id  ...  aisle_id  department_id
0          3       21903  ...       123              4
1         26       21903  ...       123              4
2         31       21903  ...       123              4
3         39       21903  ...       123              4
4         56       21903  ...       123              4
5         57       21903  ...       123              4
6         73       21903  ...       123              4
7         92       21903  ...       123              4
8        113       21903  ...       123              4
9        135       21903  ...       123              4
10       139       21903  ...       123              4
11       148       21903  ...       123              4
12       169       21903  ...       123              4
13       177       21903  ...       123              4
14       190       21903  ...       123              4
15       213       21903  ...       123              4
16       219       21903  ...       123              4
17       222       21903  ...       123              4
18       239       21903  ...       123              4
19       248       21903  ...       123              4

[20 rows x 7 columns]

In [26]:
# This should be the same length as order_products subset with more columns, 
# so I'm gonna check that

merged.shape

(2418314, 7)

In [27]:
# Nice.

# I want to get rid of some distracting columns using drop

merged = merged.drop(['add_to_cart_order','reordered','aisle_id','department_id'], axis=1)

merged.head()

   order_id  product_id          product_name
0         3       21903  Organic Baby Spinach
1        26       21903  Organic Baby Spinach
2        31       21903  Organic Baby Spinach
3        39       21903  Organic Baby Spinach
4        56       21903  Organic Baby Spinach

In [32]:
# Now I need value counts.

merged['product_name'].value_counts()

Banana                    491291
Bag of Organic Bananas    394930
Organic Strawberries      275577
Organic Baby Spinach      251705
Organic Hass Avocado      220877
Organic Avocado           184224
Large Lemon               160792
Strawberries              149445
Limes                     146660
Organic Whole Milk        142813
Name: product_name, dtype: int64

In [34]:
# baller. I'm going to try to turn that into its own table.

popular_products_counts = (merged['product_name'].value_counts())

popular_products_counts

Banana                    491291
Bag of Organic Bananas    394930
Organic Strawberries      275577
Organic Baby Spinach      251705
Organic Hass Avocado      220877
Organic Avocado           184224
Large Lemon               160792
Strawberries              149445
Limes                     146660
Organic Whole Milk        142813
Name: product_name, dtype: int64

In [ ]:
# Seems fine to me though not exactly what I was trying to do. I'll come back to
# fiddle with it later if I have enough time

## Reshape Data Section

- Replicate the lesson code. Remember, if you haven't followed along typing out what we did during lecture, do that now to get more repetition with the syntax.
- Take table 2 (the transpose of table 1) and practice changing it into Tidy format and back again. You should not use the transpose operation anywhere in this code:
 - Table 2 --> Tidy
 - Tidy --> Table 2
- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [62]:
#Replicating lesson code

df1 = pd.DataFrame({'a': [1,2,3,4], 'b': [4,5,6,7], 'c': [7,8,9,10]})

df2 = pd.DataFrame({'a': [6,4,8,7], 'b': [9,4,3,2], 'c': [1,6,2,9]})

In [63]:
df1.head()

   a  b   c
0  1  4   7
1  2  5   8
2  3  6   9
3  4  7  10

In [64]:
df2.head()

   a  b  c
0  6  9  1
1  4  4  6
2  8  3  2
3  7  2  9

In [65]:
by_rows = pd.concat([df1, df2])

In [66]:
by_rows

   a  b   c
0  1  4   7
1  2  5   8
2  3  6   9
3  4  7  10
0  6  9   1
1  4  4   6
2  8  3   2
3  7  2   9

In [67]:
by_rows = by_rows.reset_index()

by_rows

   index  a  b   c
0      0  1  4   7
1      1  2  5   8
2      2  3  6   9
3      3  4  7  10
4      0  6  9   1
5      1  4  4   6
6      2  8  3   2
7      3  7  2   9

In [68]:
by_cols = pd.concat([df1, df2], axis=1)

by_cols

   a  b   c  a  b  c
0  1  4   7  6  9  1
1  2  5   8  4  4  6
2  3  6   9  8  3  2
3  4  7  10  7  2  9

In [69]:
by_cols.columns=['a1','b1','c1','a2','b2','c2']

by_cols

   a1  b1  c1  a2  b2  c2
0   1   4   7   6   9   1
1   2   5   8   4   4   6
2   3   6   9   8   3   2
3   4   7  10   7   2   9

In [71]:
by_cols['a1']

0    1
1    2
2    3
3    4
Name: a1, dtype: int64

In [72]:
df3 = pd.DataFrame({'a': [4,3,2,1], 'b': [4,5,6,7], 'c': [7,8,9,10]})

df4 = pd.DataFrame({'a': [6,4,8,7,8], 'b': [9,4,3,2,1], 'd': [1,6,2,9,5]})

In [73]:
df3.head()

   a  b   c
0  4  4   7
1  3  5   8
2  2  6   9
3  1  7  10

In [74]:
df4.head()

   a  b  d
0  6  9  1
1  4  4  6
2  8  3  2
3  7  2  9
4  8  1  5

In [75]:
by_rows = pd.concat([df3,df4])

by_rows

   a  b     c    d
0  4  4   7.0  NaN
1  3  5   8.0  NaN
2  2  6   9.0  NaN
3  1  7  10.0  NaN
0  6  9   NaN  1.0
1  4  4   NaN  6.0
2  8  3   NaN  2.0
3  7  2   NaN  9.0
4  8  1   NaN  5.0

In [76]:
by_rows = by_rows.reset_index()
by_rows

   index  a  b     c    d
0      0  4  4   7.0  NaN
1      1  3  5   8.0  NaN
2      2  2  6   9.0  NaN
3      3  1  7  10.0  NaN
4      0  6  9   NaN  1.0
5      1  4  4   NaN  6.0
6      2  8  3   NaN  2.0
7      3  7  2   NaN  9.0
8      4  8  1   NaN  5.0

In [81]:
by_cols2 = pd.concat([df3, df4], axis=1)
by_cols2

     a    b     c  a  b  d
0  4.0  4.0   7.0  6  9  1
1  3.0  5.0   8.0  4  4  6
2  2.0  6.0   9.0  8  3  2
3  1.0  7.0  10.0  7  2  9
4  NaN  NaN   NaN  8  1  5

In [82]:
by_cols2.columns = ['a1', 'b1', 'c', 'a2', 'b2', 'd']
by_cols2

    a1   b1     c  a2  b2  d
0  4.0  4.0   7.0   6   9  1
1  3.0  5.0   8.0   4   4  6
2  2.0  6.0   9.0   8   3  2
3  1.0  7.0  10.0   7   2  9
4  NaN  NaN   NaN   8   1  5

In [83]:
df5 = pd.DataFrame({'a': [4,3,2,1], 'b': [4,5,6,7], 'c': [7,8,9,10]})

df6 = pd.DataFrame({'d': [6,4,8,7,8], 'e': [9,4,3,2,1], 'f': [1,6,2,9,5]})

In [84]:
df5

   a  b   c
0  4  4   7
1  3  5   8
2  2  6   9
3  1  7  10

In [85]:
df6

   d  e  f
0  6  9  1
1  4  4  6
2  8  3  2
3  7  2  9
4  8  1  5

In [35]:
import pandas as pd
import numpy as np

table1 = pd.DataFrame(
    [[np.nan, 2],
     [16,    11], 
     [3,      1]],
    index=['John Smith', 'Jane Doe', 'Mary Johnson'], 
    columns=['treatmenta', 'treatmentb'])

table2 = table1.T

table2

            John Smith  Jane Doe  Mary Johnson
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

In [38]:
# table2 -> tidy

table2 = table2.reset_index()

table2
#

        index  John Smith  Jane Doe  Mary Johnson
0  treatmenta         NaN      16.0           3.0
1  treatmentb         2.0      11.0           1.0

In [44]:
tidied = table2.melt(id_vars='index', value_vars=['John Smith','Jane Doe','Mary Johnson'])

tidied

        index      variable  value
0  treatmenta    John Smith    NaN
1  treatmentb    John Smith    2.0
2  treatmenta      Jane Doe   16.0
3  treatmentb      Jane Doe   11.0
4  treatmenta  Mary Johnson    3.0
5  treatmentb  Mary Johnson    1.0

In [46]:
tidied = tidied[['variable','index','value']]

tidied

       variable       index  value
0    John Smith  treatmenta    NaN
1    John Smith  treatmentb    2.0
2      Jane Doe  treatmenta   16.0
3      Jane Doe  treatmentb   11.0
4  Mary Johnson  treatmenta    3.0
5  Mary Johnson  treatmentb    1.0

In [47]:
tidied.columns = ['name', 'treatment','result']

tidied

           name   treatment  result
0    John Smith  treatmenta     NaN
1    John Smith  treatmentb     2.0
2      Jane Doe  treatmenta    16.0
3      Jane Doe  treatmentb    11.0
4  Mary Johnson  treatmenta     3.0
5  Mary Johnson  treatmentb     1.0

In [48]:
# tidy -> table2

table2_renew = tidied.pivot_table(index='treatment',columns='name',values='result')

table2_renew

name        Jane Doe  John Smith  Mary Johnson
treatment
treatmenta      16.0         NaN           3.0
treatmentb      11.0         2.0           1.0

In [50]:
import seaborn as sns

flights = sns.load_dataset('flights')

/usr/local/lib/python3.6/dist-packages/statsmodels/tools/_testing.py:19: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing as tm

In [51]:
flights.head()

   year     month  passengers
0  1949   January         112
1  1949  February         118
2  1949     March         132
3  1949     April         129
4  1949       May         121

In [52]:
# Flights Pivot Table

flights_pt = flights.pivot_table(index='year',columns='month',values='passengers')

flights_pt

month  January  February  March  April  ...  September  October  November  December
year                                    ...
1949       112       118    132    129  ...        136      119       104       118
1950       115       126    141    135  ...        158      133       114       140
1951       145       150    178    163  ...        184      162       146       166
1952       171       180    193    181  ...        209      191       172       194
1953       196       196    236    235  ...        237      211       180       201
1954       204       188    235    227  ...        259      229       203       229
1955       242       233    267    269  ...        312      274       237       278
1956       284       277    317    313  ...        355      306       271       306
1957       315       301    356    348  ...        404      347       305       336
1958       340       318    362    348  ...        404      359       310       337
1959       360       342    406    396  ...        463      407       362       405
1960       417       391    419    461  ...        508      461       390       432

[12 rows x 12 columns]

## Join Data Stretch Challenge

The [Instacart blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2) has a visualization of "**Popular products** purchased earliest in the day (green) and latest in the day (red)." 

The post says,

> "We can also see the time of day that users purchase specific products.

> Healthier snacks and staples tend to be purchased earlier in the day, whereas ice cream (especially Half Baked and The Tonight Dough) are far more popular when customers are ordering in the evening.

> **In fact, of the top 25 latest ordered products, the first 24 are ice cream! The last one, of course, is a frozen pizza.**"

Your challenge is to reproduce the list of the top 25 latest ordered popular products.

We'll define "popular products" as products with more than 2,900 orders.

In [ ]:
##### YOUR CODE HERE #####

# Which columns do I need?
# From orders, I need order_id and order_hour_of_day
# From products, I need product_id and product_name
# From order_products, I need order_id and product_id

# I should probably subset these data frames before attempting to merge them.

# I think the first thing I need is for order_id, product_id, and order_hour_of_day
# to all be in the same dataframe

# To make this smaller, what if I subset orders to only include orders that were
# placed after noon?

condition = (orders['order_hour_of_day']) >= 13
late_orders = orders[condition]

late_orders.head()

In [57]:
# I'm worried I'm going about this in the wrong way. Maybe if I only merge the columns 
# I named above, I won't exceed my ram.

merged = (orders[['order_id', 'order_hour_of_day']]
          .merge(order_products[['order_id','product_id']])
          .merge(products[['product_id','product_name']]))

merged.shape

(33819106, 4)

In [58]:
merged.head()

   order_id  order_hour_of_day  product_id product_name
0   2539329                  8         196         Soda
1   2398795                  7         196         Soda
2    473747                 12         196         Soda
3   2254736                  7         196         Soda
4    431534                 15         196         Soda

In [59]:
merged = merged.sort_values('order_hour_of_day', ascending=False)

merged.head()

          order_id  ...                                product_name
32366592   3397013  ...                     Premium Small Red Beans
1437048    2225560  ...                                Strawberries
16271634   2229154  ...   Southwest Chopped Salad Kit with Dressing
16271609   2846367  ...   Southwest Chopped Salad Kit with Dressing
26505283   2155935  ...  Organic Sesame Ginger Vinaigrette Dressing

[5 rows x 4 columns]

In [61]:
# I'm going to try to find the average time of day each product was purchased

# First, isolate only two columns from merged

merged_subset = merged[['order_hour_of_day','product_name']]

merged_subset.head(15)

          order_hour_of_day                                       product_name
32366592                 23                            Premium Small Red Beans
1437048                  23                                       Strawberries
16271634                 23          Southwest Chopped Salad Kit with Dressing
16271609                 23          Southwest Chopped Salad Kit with Dressing
26505283                 23         Organic Sesame Ginger Vinaigrette Dressing
22237386                 23                               Natural Spring Water
30091209                 23  Heart to Heart Organic Oat Flakes & Blueberry ...
20399769                 23                                       Organic Dill
12650010                 23                    Sour Cream & Onion Potato Chips
18224841                 23                        Squash & Sweet Peas Stage 2
30522262                 23                       Pure Organic Pineapple Juice
20399770                 23                                       Organic Dill
18224850                 23                        Squash & Sweet Peas Stage 2
28468080                 23                            Fresh Mozzarella Cheese
19836775                 23                         Tomatoes, Crushed, Organic

In [ ]:
# create a new data frame collecting all the numbers for every product

## Reshape Data Stretch Challenge

_Try whatever sounds most interesting to you!_

- Replicate more of Instacart's visualization showing "Hour of Day Ordered" vs "Percent of Orders by Product"
- Replicate parts of the other visualization from [Instacart's blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2), showing "Number of Purchases" vs "Percent Reorder Purchases"
- Get the most recent order for each user in Instacart's dataset. This is a useful baseline when [predicting a user's next order](https://www.kaggle.com/c/instacart-market-basket-analysis)
- Replicate parts of the blog post linked at the top of this notebook: [Modern Pandas, Part 5: Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [ ]:
##### YOUR CODE HERE #####